Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/sfr.h
/*
 * Component description for SFR
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-24T14:43:55Z */
#ifndef _SAMA5D2_SFR_COMPONENT_H_
#define _SAMA5D2_SFR_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SFR                                          */
/* ************************************************************************** */

/* -------- SFR_DDRCFG : (SFR Offset: 0x04) (R/W 32) DDR Configuration Register -------- */
#define SFR_DDRCFG_FDQIEN_Pos                 _UINT32_(16)                                         /* (SFR_DDRCFG) Force DDR_DQ Input Buffer Always On Position */
#define SFR_DDRCFG_FDQIEN_Msk                 (_UINT32_(0x1) << SFR_DDRCFG_FDQIEN_Pos)             /* (SFR_DDRCFG) Force DDR_DQ Input Buffer Always On Mask */
#define SFR_DDRCFG_FDQIEN(value)              (SFR_DDRCFG_FDQIEN_Msk & (_UINT32_(value) << SFR_DDRCFG_FDQIEN_Pos)) /* Assigment of value for FDQIEN in the SFR_DDRCFG register */
#define SFR_DDRCFG_FDQSIEN_Pos                _UINT32_(17)                                         /* (SFR_DDRCFG) Force DDR_DQS Input Buffer Always On Position */
#define SFR_DDRCFG_FDQSIEN_Msk                (_UINT32_(0x1) << SFR_DDRCFG_FDQSIEN_Pos)            /* (SFR_DDRCFG) Force DDR_DQS Input Buffer Always On Mask */
#define SFR_DDRCFG_FDQSIEN(value)             (SFR_DDRCFG_FDQSIEN_Msk & (_UINT32_(value) << SFR_DDRCFG_FDQSIEN_Pos)) /* Assigment of value for FDQSIEN in the SFR_DDRCFG register */
#define SFR_DDRCFG_Msk                        _UINT32_(0x00030000)                                 /* (SFR_DDRCFG) Register Mask  */


/* -------- SFR_OHCIICR : (SFR Offset: 0x10) (R/W 32) OHCI Interrupt Configuration Register -------- */
#define SFR_OHCIICR_RES0_Pos                  _UINT32_(0)                                          /* (SFR_OHCIICR) USB PORTx RESET Position */
#define SFR_OHCIICR_RES0_Msk                  (_UINT32_(0x1) << SFR_OHCIICR_RES0_Pos)              /* (SFR_OHCIICR) USB PORTx RESET Mask */
#define SFR_OHCIICR_RES0(value)               (SFR_OHCIICR_RES0_Msk & (_UINT32_(value) << SFR_OHCIICR_RES0_Pos)) /* Assigment of value for RES0 in the SFR_OHCIICR register */
#define SFR_OHCIICR_RES1_Pos                  _UINT32_(1)                                          /* (SFR_OHCIICR) USB PORTx RESET Position */
#define SFR_OHCIICR_RES1_Msk                  (_UINT32_(0x1) << SFR_OHCIICR_RES1_Pos)              /* (SFR_OHCIICR) USB PORTx RESET Mask */
#define SFR_OHCIICR_RES1(value)               (SFR_OHCIICR_RES1_Msk & (_UINT32_(value) << SFR_OHCIICR_RES1_Pos)) /* Assigment of value for RES1 in the SFR_OHCIICR register */
#define SFR_OHCIICR_RES2_Pos                  _UINT32_(2)                                          /* (SFR_OHCIICR) USB PORTx RESET Position */
#define SFR_OHCIICR_RES2_Msk                  (_UINT32_(0x1) << SFR_OHCIICR_RES2_Pos)              /* (SFR_OHCIICR) USB PORTx RESET Mask */
#define SFR_OHCIICR_RES2(value)               (SFR_OHCIICR_RES2_Msk & (_UINT32_(value) << SFR_OHCIICR_RES2_Pos)) /* Assigment of value for RES2 in the SFR_OHCIICR register */
#define SFR_OHCIICR_ARIE_Pos                  _UINT32_(4)                                          /* (SFR_OHCIICR) OHCI Asynchronous Resume Interrupt Enable Position */
#define SFR_OHCIICR_ARIE_Msk                  (_UINT32_(0x1) << SFR_OHCIICR_ARIE_Pos)              /* (SFR_OHCIICR) OHCI Asynchronous Resume Interrupt Enable Mask */
#define SFR_OHCIICR_ARIE(value)               (SFR_OHCIICR_ARIE_Msk & (_UINT32_(value) << SFR_OHCIICR_ARIE_Pos)) /* Assigment of value for ARIE in the SFR_OHCIICR register */
#define SFR_OHCIICR_APPSTART_Pos              _UINT32_(5)                                          /* (SFR_OHCIICR) Reserved Position */
#define SFR_OHCIICR_APPSTART_Msk              (_UINT32_(0x1) << SFR_OHCIICR_APPSTART_Pos)          /* (SFR_OHCIICR) Reserved Mask */
#define SFR_OHCIICR_APPSTART(value)           (SFR_OHCIICR_APPSTART_Msk & (_UINT32_(value) << SFR_OHCIICR_APPSTART_Pos)) /* Assigment of value for APPSTART in the SFR_OHCIICR register */
#define SFR_OHCIICR_SUSPEND_A_Pos             _UINT32_(8)                                          /* (SFR_OHCIICR) USB PORT A Position */
#define SFR_OHCIICR_SUSPEND_A_Msk             (_UINT32_(0x1) << SFR_OHCIICR_SUSPEND_A_Pos)         /* (SFR_OHCIICR) USB PORT A Mask */
#define SFR_OHCIICR_SUSPEND_A(value)          (SFR_OHCIICR_SUSPEND_A_Msk & (_UINT32_(value) << SFR_OHCIICR_SUSPEND_A_Pos)) /* Assigment of value for SUSPEND_A in the SFR_OHCIICR register */
#define SFR_OHCIICR_SUSPEND_B_Pos             _UINT32_(9)                                          /* (SFR_OHCIICR) USB PORT B Position */
#define SFR_OHCIICR_SUSPEND_B_Msk             (_UINT32_(0x1) << SFR_OHCIICR_SUSPEND_B_Pos)         /* (SFR_OHCIICR) USB PORT B Mask */
#define SFR_OHCIICR_SUSPEND_B(value)          (SFR_OHCIICR_SUSPEND_B_Msk & (_UINT32_(value) << SFR_OHCIICR_SUSPEND_B_Pos)) /* Assigment of value for SUSPEND_B in the SFR_OHCIICR register */
#define SFR_OHCIICR_SUSPEND_C_Pos             _UINT32_(10)                                         /* (SFR_OHCIICR) USB PORT C Position */
#define SFR_OHCIICR_SUSPEND_C_Msk             (_UINT32_(0x1) << SFR_OHCIICR_SUSPEND_C_Pos)         /* (SFR_OHCIICR) USB PORT C Mask */
#define SFR_OHCIICR_SUSPEND_C(value)          (SFR_OHCIICR_SUSPEND_C_Msk & (_UINT32_(value) << SFR_OHCIICR_SUSPEND_C_Pos)) /* Assigment of value for SUSPEND_C in the SFR_OHCIICR register */
#define SFR_OHCIICR_UDPPUDIS_Pos              _UINT32_(23)                                         /* (SFR_OHCIICR) USB DEVICE PULLUP DISABLE Position */
#define SFR_OHCIICR_UDPPUDIS_Msk              (_UINT32_(0x1) << SFR_OHCIICR_UDPPUDIS_Pos)          /* (SFR_OHCIICR) USB DEVICE PULLUP DISABLE Mask */
#define SFR_OHCIICR_UDPPUDIS(value)           (SFR_OHCIICR_UDPPUDIS_Msk & (_UINT32_(value) << SFR_OHCIICR_UDPPUDIS_Pos)) /* Assigment of value for UDPPUDIS in the SFR_OHCIICR register */
#define SFR_OHCIICR_HSIC_SEL_Pos              _UINT32_(27)                                         /* (SFR_OHCIICR) Reserved Position */
#define SFR_OHCIICR_HSIC_SEL_Msk              (_UINT32_(0x1) << SFR_OHCIICR_HSIC_SEL_Pos)          /* (SFR_OHCIICR) Reserved Mask */
#define SFR_OHCIICR_HSIC_SEL(value)           (SFR_OHCIICR_HSIC_SEL_Msk & (_UINT32_(value) << SFR_OHCIICR_HSIC_SEL_Pos)) /* Assigment of value for HSIC_SEL in the SFR_OHCIICR register */
#define SFR_OHCIICR_Msk                       _UINT32_(0x08800737)                                 /* (SFR_OHCIICR) Register Mask  */

