Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/sfr.h
#define SFR_OHCIICR_RES_Pos                   _UINT32_(0)                                          /* (SFR_OHCIICR Position) USB PORTx RESET */
#define SFR_OHCIICR_RES_Msk                   (_UINT32_(0x7) << SFR_OHCIICR_RES_Pos)               /* (SFR_OHCIICR Mask) RES */
#define SFR_OHCIICR_RES(value)                (SFR_OHCIICR_RES_Msk & (_UINT32_(value) << SFR_OHCIICR_RES_Pos)) 

/* -------- SFR_OHCIISR : (SFR Offset: 0x14) ( R/ 32) OHCI Interrupt Status Register -------- */
#define SFR_OHCIISR_RIS0_Pos                  _UINT32_(0)                                          /* (SFR_OHCIISR) OHCI Resume Interrupt Status Port 0 Position */
#define SFR_OHCIISR_RIS0_Msk                  (_UINT32_(0x1) << SFR_OHCIISR_RIS0_Pos)              /* (SFR_OHCIISR) OHCI Resume Interrupt Status Port 0 Mask */
#define SFR_OHCIISR_RIS0(value)               (SFR_OHCIISR_RIS0_Msk & (_UINT32_(value) << SFR_OHCIISR_RIS0_Pos)) /* Assigment of value for RIS0 in the SFR_OHCIISR register */
#define SFR_OHCIISR_RIS1_Pos                  _UINT32_(1)                                          /* (SFR_OHCIISR) OHCI Resume Interrupt Status Port 1 Position */
#define SFR_OHCIISR_RIS1_Msk                  (_UINT32_(0x1) << SFR_OHCIISR_RIS1_Pos)              /* (SFR_OHCIISR) OHCI Resume Interrupt Status Port 1 Mask */
#define SFR_OHCIISR_RIS1(value)               (SFR_OHCIISR_RIS1_Msk & (_UINT32_(value) << SFR_OHCIISR_RIS1_Pos)) /* Assigment of value for RIS1 in the SFR_OHCIISR register */
#define SFR_OHCIISR_RIS2_Pos                  _UINT32_(2)                                          /* (SFR_OHCIISR) OHCI Resume Interrupt Status Port 2 Position */
#define SFR_OHCIISR_RIS2_Msk                  (_UINT32_(0x1) << SFR_OHCIISR_RIS2_Pos)              /* (SFR_OHCIISR) OHCI Resume Interrupt Status Port 2 Mask */
#define SFR_OHCIISR_RIS2(value)               (SFR_OHCIISR_RIS2_Msk & (_UINT32_(value) << SFR_OHCIISR_RIS2_Pos)) /* Assigment of value for RIS2 in the SFR_OHCIISR register */
#define SFR_OHCIISR_Msk                       _UINT32_(0x00000007)                                 /* (SFR_OHCIISR) Register Mask  */

#define SFR_OHCIISR_RIS_Pos                   _UINT32_(0)                                          /* (SFR_OHCIISR Position) OHCI Resume Interrupt Status Port 2 */
#define SFR_OHCIISR_RIS_Msk                   (_UINT32_(0x7) << SFR_OHCIISR_RIS_Pos)               /* (SFR_OHCIISR Mask) RIS */
#define SFR_OHCIISR_RIS(value)                (SFR_OHCIISR_RIS_Msk & (_UINT32_(value) << SFR_OHCIISR_RIS_Pos)) 

/* -------- SFR_SECURE : (SFR Offset: 0x28) (R/W 32) Security Configuration Register -------- */
#define SFR_SECURE_ROM_Pos                    _UINT32_(0)                                          /* (SFR_SECURE) Disable Access to ROM Code Position */
#define SFR_SECURE_ROM_Msk                    (_UINT32_(0x1) << SFR_SECURE_ROM_Pos)                /* (SFR_SECURE) Disable Access to ROM Code Mask */
#define SFR_SECURE_ROM(value)                 (SFR_SECURE_ROM_Msk & (_UINT32_(value) << SFR_SECURE_ROM_Pos)) /* Assigment of value for ROM in the SFR_SECURE register */
#define SFR_SECURE_FUSE_Pos                   _UINT32_(8)                                          /* (SFR_SECURE) Disable Access to Fuse Controller Position */
#define SFR_SECURE_FUSE_Msk                   (_UINT32_(0x1) << SFR_SECURE_FUSE_Pos)               /* (SFR_SECURE) Disable Access to Fuse Controller Mask */
#define SFR_SECURE_FUSE(value)                (SFR_SECURE_FUSE_Msk & (_UINT32_(value) << SFR_SECURE_FUSE_Pos)) /* Assigment of value for FUSE in the SFR_SECURE register */
#define SFR_SECURE_Msk                        _UINT32_(0x00000101)                                 /* (SFR_SECURE) Register Mask  */


/* -------- SFR_UTMICKTRIM : (SFR Offset: 0x30) (R/W 32) UTMI Clock Trimming Register -------- */
#define SFR_UTMICKTRIM_FREQ_Pos               _UINT32_(0)                                          /* (SFR_UTMICKTRIM) UTMI Reference Clock Frequency Position */
#define SFR_UTMICKTRIM_FREQ_Msk               (_UINT32_(0x3) << SFR_UTMICKTRIM_FREQ_Pos)           /* (SFR_UTMICKTRIM) UTMI Reference Clock Frequency Mask */
#define SFR_UTMICKTRIM_FREQ(value)            (SFR_UTMICKTRIM_FREQ_Msk & (_UINT32_(value) << SFR_UTMICKTRIM_FREQ_Pos)) /* Assigment of value for FREQ in the SFR_UTMICKTRIM register */
#define   SFR_UTMICKTRIM_FREQ_12_Val          _UINT32_(0x0)                                        /* (SFR_UTMICKTRIM) 12 MHz reference clock  */
#define   SFR_UTMICKTRIM_FREQ_16_Val          _UINT32_(0x1)                                        /* (SFR_UTMICKTRIM) 16 MHz reference clock  */
#define   SFR_UTMICKTRIM_FREQ_24_Val          _UINT32_(0x2)                                        /* (SFR_UTMICKTRIM) 24 MHz reference clock  */
#define SFR_UTMICKTRIM_FREQ_12                (SFR_UTMICKTRIM_FREQ_12_Val << SFR_UTMICKTRIM_FREQ_Pos) /* (SFR_UTMICKTRIM) 12 MHz reference clock Position  */
#define SFR_UTMICKTRIM_FREQ_16                (SFR_UTMICKTRIM_FREQ_16_Val << SFR_UTMICKTRIM_FREQ_Pos) /* (SFR_UTMICKTRIM) 16 MHz reference clock Position  */
#define SFR_UTMICKTRIM_FREQ_24                (SFR_UTMICKTRIM_FREQ_24_Val << SFR_UTMICKTRIM_FREQ_Pos) /* (SFR_UTMICKTRIM) 24 MHz reference clock Position  */
#define SFR_UTMICKTRIM_VBG_Pos                _UINT32_(16)                                         /* (SFR_UTMICKTRIM) UTMI Band Gap Voltage Trimming Position */
#define SFR_UTMICKTRIM_VBG_Msk                (_UINT32_(0x3) << SFR_UTMICKTRIM_VBG_Pos)            /* (SFR_UTMICKTRIM) UTMI Band Gap Voltage Trimming Mask */
#define SFR_UTMICKTRIM_VBG(value)             (SFR_UTMICKTRIM_VBG_Msk & (_UINT32_(value) << SFR_UTMICKTRIM_VBG_Pos)) /* Assigment of value for VBG in the SFR_UTMICKTRIM register */
#define SFR_UTMICKTRIM_Msk                    _UINT32_(0x00030003)                                 /* (SFR_UTMICKTRIM) Register Mask  */


/* -------- SFR_UTMIHSTRIM : (SFR Offset: 0x34) (R/W 32) UTMI High-Speed Trimming Register -------- */
#define SFR_UTMIHSTRIM_SQUELCH_Pos            _UINT32_(0)                                          /* (SFR_UTMIHSTRIM) UTMI HS SQUELCH Voltage Trimming Position */
#define SFR_UTMIHSTRIM_SQUELCH_Msk            (_UINT32_(0x7) << SFR_UTMIHSTRIM_SQUELCH_Pos)        /* (SFR_UTMIHSTRIM) UTMI HS SQUELCH Voltage Trimming Mask */
#define SFR_UTMIHSTRIM_SQUELCH(value)         (SFR_UTMIHSTRIM_SQUELCH_Msk & (_UINT32_(value) << SFR_UTMIHSTRIM_SQUELCH_Pos)) /* Assigment of value for SQUELCH in the SFR_UTMIHSTRIM register */
#define SFR_UTMIHSTRIM_DISC_Pos               _UINT32_(4)                                          /* (SFR_UTMIHSTRIM) UTMI Disconnect Voltage Trimming Position */
#define SFR_UTMIHSTRIM_DISC_Msk               (_UINT32_(0x7) << SFR_UTMIHSTRIM_DISC_Pos)           /* (SFR_UTMIHSTRIM) UTMI Disconnect Voltage Trimming Mask */
#define SFR_UTMIHSTRIM_DISC(value)            (SFR_UTMIHSTRIM_DISC_Msk & (_UINT32_(value) << SFR_UTMIHSTRIM_DISC_Pos)) /* Assigment of value for DISC in the SFR_UTMIHSTRIM register */
#define SFR_UTMIHSTRIM_SLOPE0_Pos             _UINT32_(8)                                          /* (SFR_UTMIHSTRIM) UTMI HS PORTx Transceiver Slope Trimming Position */
#define SFR_UTMIHSTRIM_SLOPE0_Msk             (_UINT32_(0x7) << SFR_UTMIHSTRIM_SLOPE0_Pos)         /* (SFR_UTMIHSTRIM) UTMI HS PORTx Transceiver Slope Trimming Mask */
#define SFR_UTMIHSTRIM_SLOPE0(value)          (SFR_UTMIHSTRIM_SLOPE0_Msk & (_UINT32_(value) << SFR_UTMIHSTRIM_SLOPE0_Pos)) /* Assigment of value for SLOPE0 in the SFR_UTMIHSTRIM register */
#define SFR_UTMIHSTRIM_SLOPE1_Pos             _UINT32_(12)                                         /* (SFR_UTMIHSTRIM) UTMI HS PORTx Transceiver Slope Trimming Position */
#define SFR_UTMIHSTRIM_SLOPE1_Msk             (_UINT32_(0x7) << SFR_UTMIHSTRIM_SLOPE1_Pos)         /* (SFR_UTMIHSTRIM) UTMI HS PORTx Transceiver Slope Trimming Mask */
#define SFR_UTMIHSTRIM_SLOPE1(value)          (SFR_UTMIHSTRIM_SLOPE1_Msk & (_UINT32_(value) << SFR_UTMIHSTRIM_SLOPE1_Pos)) /* Assigment of value for SLOPE1 in the SFR_UTMIHSTRIM register */
#define SFR_UTMIHSTRIM_SLOPE2_Pos             _UINT32_(16)                                         /* (SFR_UTMIHSTRIM) UTMI HS PORTx Transceiver Slope Trimming Position */
#define SFR_UTMIHSTRIM_SLOPE2_Msk             (_UINT32_(0x7) << SFR_UTMIHSTRIM_SLOPE2_Pos)         /* (SFR_UTMIHSTRIM) UTMI HS PORTx Transceiver Slope Trimming Mask */
#define SFR_UTMIHSTRIM_SLOPE2(value)          (SFR_UTMIHSTRIM_SLOPE2_Msk & (_UINT32_(value) << SFR_UTMIHSTRIM_SLOPE2_Pos)) /* Assigment of value for SLOPE2 in the SFR_UTMIHSTRIM register */
#define SFR_UTMIHSTRIM_Msk                    _UINT32_(0x00077777)                                 /* (SFR_UTMIHSTRIM) Register Mask  */


