Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/sfr.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SFR register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       SFR_DDRCFG;         /**< Offset: 0x04 (R/W  32) DDR Configuration Register */
  __I   uint8_t                        Reserved2[0x08];
  __IO  uint32_t                       SFR_OHCIICR;        /**< Offset: 0x10 (R/W  32) OHCI Interrupt Configuration Register */
  __I   uint32_t                       SFR_OHCIISR;        /**< Offset: 0x14 (R/   32) OHCI Interrupt Status Register */
  __I   uint8_t                        Reserved3[0x10];
  __IO  uint32_t                       SFR_SECURE;         /**< Offset: 0x28 (R/W  32) Security Configuration Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       SFR_UTMICKTRIM;     /**< Offset: 0x30 (R/W  32) UTMI Clock Trimming Register */
  __IO  uint32_t                       SFR_UTMIHSTRIM;     /**< Offset: 0x34 (R/W  32) UTMI High-Speed Trimming Register */
  __IO  uint32_t                       SFR_UTMIFSTRIM;     /**< Offset: 0x38 (R/W  32) UTMI Full-Speed Trimming Register */
  __IO  uint32_t                       SFR_UTMISWAP;       /**< Offset: 0x3C (R/W  32) UTMI DP/DM Pin Swapping Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       SFR_CAN;            /**< Offset: 0x48 (R/W  32) CAN Memories Address-based Register */
  __I   uint32_t                       SFR_SN0;            /**< Offset: 0x4C (R/   32) Serial Number 0 Register */
  __I   uint32_t                       SFR_SN1;            /**< Offset: 0x50 (R/   32) Serial Number 1 Register */
  __IO  uint32_t                       SFR_AICREDIR;       /**< Offset: 0x54 (R/W  32) AIC Interrupt Redirection Register */
  __IO  uint32_t                       SFR_L2CC_HRAMC;     /**< Offset: 0x58 (R/W  32) L2CC_HRAMC1 */
  __I   uint8_t                        Reserved6[0x34];
  __IO  uint32_t                       SFR_I2SCLKSEL;      /**< Offset: 0x90 (R/W  32) I2SC Register */
  __IO  uint32_t                       SFR_QSPICLK_REG;    /**< Offset: 0x94 (R/W  32) QSPI Clock Pad Supply Select Register */
} sfr_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_SFR_COMPONENT_H_ */
